app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R')  ORDER BY "movies"."release_date" ASC
---
  def index
    @all_ratings = Movie.distinct.pluck(:rating)
    @ratings = (params[:ratings].present? ? params[:ratings] : @all_ratings)
    # debugger
    if params[:sort] == 'title'
      @movies = Movie.order('title ASC')
      @title_hilite = 'hilite'
      session[:sort] = params[:sort]
    elsif params[:sort] == 'release_date'
      @movies = Movie.order('release_date ASC')
      @relese_date_hilite = 'hilite'
      session[:sort] = params[:sort]
    elsif params[:ratings]
      @movies = Movie.where(rating: params[:ratings].keys)